run/tutorials/combustion/reactingFoam/Lagrangian/filter/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

buoyancyForce
{
    type        buoyancyForce;
}

clouds
{
    type    clouds;
    libs    ("liblagrangianParcel.so");
}

filter1
{
    type            explicitPorositySource;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        filter;

        type            DarcyForchheimer;

        d   (500000 -1000 -1000);
        f   (0 0 0);

        coordinateSystem
        {
            type    cartesian;
            origin  (0 0 0);
            coordinateRotation
            {
                type    axesRotation;
                e1  (1 0 0);
                e2  (0 1 0);
            }
        }
    }
}

massSource
{
    type            massSource;

    selectionMode   points;
    points
    (
        (2.75 0.5 0)
    );

    massFlowRate
    {
        type            scale;
        scale           squarePulse;
        start           0.2;
        duration        2;
        value           1e-4;
    }

    fieldValues
    {
        U               (0 50 0);
        h               100000;
        O2              0;
        H2O             1;
        k               0.0938;
        epsilon         0.0449;
    }
}

// ************************************************************************* //
